# src/lessons/
**lesson1:**
1. task1: Используя циклы и метод:
System.out.print("* "), System.out.print("  "),
System.out.print("\n")
(для перехода на новую строку).
Выведите на экран:
  - прямоугольник
  - прямоугольный треугольник
  - равносторонний треугольник
  - ромб
2. task2: Сортировка последовательности
  - Упорядочить одномерный масиве вначале отрицательные повозрастанию
   затем положительные по убыванию.
  - В одномерном массиве сначала положительные потом отрицательные за О(n)
3. task3: Дана целочисленная прямоугольная матрица.
   - Упорядочить столбцы по убыванию среднего значения.
4. task4: Дана квадратная матрица A порядка M (M — нечетное число). Начи-
ная с элемента A1,1 и перемещаясь по часовой стрелке, вывести все ее эле-
менты по спирали: первая строка, последний столбец, последняя строка в
обратном  порядке,  первый  столбец  в  обратном  порядке,  оставшиеся  эле-
менты второй строки и т. д.; последним выводится центральный элемент матрицы.

---

**lesson2:**
1. task1: Cоздать динамический массив из разных фигур и вывести информацию на экран.
2. task2: Cоздать класс Polygon для описания фигур разной размерности.

---

**lesson3:**
1. Создать абстрактный класс Vehicle. На его основе реализовать классы Plane, Car, Ship.
Классы должны иметь возможность задавать и получать координаты, параметры средст передвижения(цена, скорость, год выпуска).
Для самолета должна быть определена высота, для самолета и корабля - количество пассажиров.
Для корабля порт приписки.
Написать программу, создающую список обьектов этих классов в динамиеской памяти.
Программа должна содержать меню, позволяющее осуществить проверку всех методов классов.
2. Найти:
  - Vehicle с наибольшей ценой
  - Механизм год выпуска 2000-2005 с  скоростью выше 150 км\ч, и наименьшей ценой
  - Из Масива Vehicle получить масив Car не старше 5 лет
  - Из Масива Vehicle получить масив Ship не старше 5 лет, с  отсортированой ценой по убыванию

---

**lesson4:**
1. Upgrade задания Lesson3:
  - Добавить машину Амфибию, БетМобиль
  - Добавляем 3 интерфейса IFly, ISwim, Imove
  - Создать 3 последовательности  IFly, ISwim, Imove
  - В рамках каждой последовательности упорядочить по скорости
  - Методы Мин Макс

---

**lesson5:**
1. Добавить к механизмам детали двумя классами -
   один статический, один иннер.
   
---
   
**lesson6:**
1. Сериализовать фигуры(lesson2): 3 точки, 3 линии, 1 треугольник.
2. Сделать 3 файла с сериализованим polygon(lesson2) который будет описывать 3 разные фигуры и десериализовать. Отобразить на екран.





                           

