# src/lessons/
**lesson1:**

1. task1: Используя циклы и метод:
System.out.print("* "), System.out.print("  "),
System.out.print("\n")
(для перехода на новую строку).
Выведите на экран:
  - прямоугольник
  - прямоугольный треугольник
  - равносторонний треугольник
  - ромб
  
2.task2: Сортировка последовательности
  - Упорядочить одномерный масиве вначале отрицательные повозрастанию
   затем положительные по убыванию.
  - В одномерном массиве сначала положительные потом отрицательные за О(n)
  
3.task3: Дана целочисленная прямоугольная матрица.
   - Упорядочить столбцы по убыванию среднего значения.
   
4.task4: Дана квадратная матрица A порядка M (M — нечетное число). Начи-
ная с элемента A1,1 и перемещаясь по часовой стрелке, вывести все ее эле-
менты по спирали: первая строка, последний столбец, последняя строка в
обратном  порядке,  первый  столбец  в  обратном  порядке,  оставшиеся  эле-
менты второй строки и т. д.; последним выводится центральный элемент матрицы.

---

**lesson2:**
1. task1: Cоздать динамический массив из разных фигур и вывести информацию на экран.
2. task2: Cоздать класс Polygon для описания фигур разной размерности.

---

**lesson3:**
1. Создать абстрактный класс Vehicle. На его основе реализовать классы Plane, Car, Ship.
Классы должны иметь возможность задавать и получать координаты, параметры средст передвижения(цена, скорость, год выпуска).
Для самолета должна быть определена высота, для самолета и корабля - количество пассажиров.
Для корабля порт приписки.
Написать программу, создающую список обьектов этих классов в динамиеской памяти.
Программа должна содержать меню, позволяющее осуществить проверку всех методов классов.
2. Найти:
  - Vehicle с наибольшей ценой
  - Механизм год выпуска 2000-2005 с  скоростью выше 150 км\ч, и наименьшей ценой
  - Из Масива Vehicle получить масив Car не старше 5 лет
  - Из Масива Vehicle получить масив Ship не старше 5 лет, с  отсортированой ценой по убыванию

---

**lesson4:**
1. Upgrade задания Lesson3:
  - Добавить машину Амфибию, БетМобиль
  - Добавляем 3 интерфейса IFly, ISwim, Imove
  - Создать 3 последовательности  IFly, ISwim, Imove
  - В рамках каждой последовательности упорядочить по скорости
  - Методы Мин Макс

---

**lesson5:**
1. Добавить к механизмам детали двумя классами -
   один статический, один иннер.
   
---
   
**lesson6:**
1. Сериализовать фигуры(lesson2): 3 точки, 3 линии, 1 треугольник.
2. Сделать 3 файла с сериализованим polygon(lesson2 ) который будет описывать 3 разные фигуры и десериализовать. Отобразить на екран.

---

# Module1_Stones
1. Определить иерархию драгоценных и полудрагоценных камней.
2. Отобрать камни для ожерелья.
3. Посчитать общий вес (в каратах) и стоимость. 
4. Провести сортировку камней ожерелья на основе ценности. 
5. Найти камни в ожерелье, соответствующие заданному диапазону параметров прозрачности.

---

# Lesson7_RPN
1. stack calculator + sin, cos, tan

---

# Lesson_8_SearchUrl
1. написать поисковый сервис по указаному слову найти все URL упорядоченые по возрастанию частоты слова по произвольному URL перейти и спомощью регулярного выражения найти 20 URL каждому указываете ключевые слова с частотами Mock для проекта проилюстрировать необходимость

---

# News_Agency
1. Разработать программу, обеспечивающую ввод и редактирование информации об объектах в соответствии с заданной предметной областью.
- Предметная область - Агентство новостей
- Объекты: Категории новостей, Новости

---

# Lesson 13
1. Переделать News_Agency с dao
2. log4j INFO ERROR
3. info на консоль
4. info в файл историю запуска
5. connection pool для соединения
6. транзакции с вариантом изоляции
7. сделать несколько savePoint 

---


